КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм</name>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелефонНеЗарегестрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьВОчередь(Телефон, Сообщения) Экспорт
	
	ТриДняВСекундах = 60 * 60 * 24 * 3;
	
	ДатаАктуальности = ТекущаяДатаСеанса() + ТриДняВСекундах;
	
	Если ЗначениеЗаполнено(Телефон) Тогда
		ДобавитьСообщениеВОчередь_(Телефон, ДатаАктуальности, Сообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьСообщения(ТелефоныДляОтправки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ТелефоныДляОтправки) Тогда
		УдалитьУстаревшиеСообщения();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Телефоны", ТелефоныДляОтправки);
	Запрос.УстановитьПараметр("ОтборПоТелефонам", ЗначениеЗаполнено(ТелефоныДляОтправки));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.Телефон КАК Телефон,
	|	КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДатаАктуальности КАК ДатаАктуальности,
	|	КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДанныеСообщения КАК ДанныеСообщения
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм КАК КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм
	|ГДЕ
	|	(&ОтборПоТелефонам
	|				И КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.Телефон В (&Телефоны)
	|			ИЛИ НЕ &ОтборПоТелефонам)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаАктуальности
	|ИТОГИ ПО
	|	Телефон";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПоТелефонам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоТелефонам.Следующий() Цикл
		
		ВыборкаСообщений = ВыборкаПоТелефонам.Выбрать();
		
		Пока ВыборкаСообщений.Следующий() Цикл
			
			СообщенияНаДату = ВыборкаСообщений.ДанныеСообщения.Получить();
			
			НетСообщений = (СообщенияНаДату = Неопределено
				Или (ТипЗнч(СообщенияНаДату) = Тип("Массив")
					И СообщенияНаДату.Количество() = 0));
			
			Если НетСообщений Тогда
				// Удаляем запись
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Телефон.Установить(ВыборкаПоТелефонам.Телефон);
				НаборЗаписей.Отбор.ДатаАктуальности.Установить(ВыборкаСообщений.ДатаАктуальности);
				НаборЗаписей.Записать();
				
				Продолжить;
			КонецЕсли;
			
			Результат = КонтурЛогистика_РаботаСТелеграм.ОтправитьСообщения(ВыборкаПоТелефонам.Телефон, СообщенияНаДату);
			
			Если Результат.ТелефонЗарегестрирован <> Неопределено И Не Результат.ТелефонЗарегестрирован Тогда
				УстановитьПризнакТелефонНеЗарегестрирован(ВыборкаПоТелефонам.Телефон, ВыборкаСообщений.ДатаАктуальности);
				Прервать;
			КонецЕсли;
			
			Если Результат.СообщениеОтправлено <> Неопределено И Результат.СообщениеОтправлено Тогда
				// Удаляем запись
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Телефон.Установить(ВыборкаПоТелефонам.Телефон);
				НаборЗаписей.Отбор.ДатаАктуальности.Установить(ВыборкаСообщений.ДатаАктуальности);
				НаборЗаписей.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСообщениеВОчередь_(Телефон, ДатаАктуальности, Сообщения)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Телефон.Установить(Телефон);
	НаборЗаписей.Отбор.ДатаАктуальности.Установить(ДатаАктуальности);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		// На дату нет сообщений. Добавляем новое.
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Телефон = Телефон;
		НоваяЗапись.ДатаАктуальности = ДатаАктуальности;
		НоваяЗапись.ДанныеСообщения = Новый ХранилищеЗначения(Сообщения);
	Иначе
		// На дату есть сообщение. Дополняем старое новыми сообщениями.
		ТекущаяЗапись = НаборЗаписей[0];
		
		// Извлекаем сообщения из очереди
		СообщенияТекущейЗаписи = ТекущаяЗапись.ДанныеСообщения.Получить();
		
		// Дополняем новыми сообщениями
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СообщенияТекущейЗаписи, Сообщения);
		
		// Возвращаем дополненные сообщения в очередь
		ТекущаяЗапись.ДанныеСообщения = Новый ХранилищеЗначения(СообщенияТекущейЗаписи);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьУстаревшиеСообщения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.Телефон КАК Телефон,
	|	КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДатаАктуальности КАК ДатаАктуальности
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм КАК КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм
	|ГДЕ
	|	КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДатаАктуальности > ДАТАВРЕМЯ(1, 1, 1)
	|	И КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДатаАктуальности < &ТекущаяДата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Телефон.Установить(Выборка.Телефон);
		НаборЗаписей.Отбор.ДатаАктуальности.Установить(Выборка.ДатаАктуальности);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПризнакТелефонНеЗарегестрирован(Телефон, ДатаАктуальности)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Телефон.Установить(Телефон);
	НаборЗаписей.Отбор.ДатаАктуальности.Установить(ДатаАктуальности);
	НаборЗаписей.Прочитать();
	
	Для Каждого ТекущаяЗапись Из НаборЗаписей Цикл
		ТекущаяЗапись.ТелефонНеЗарегестрирован = Истина;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
